Revit 2027 API
EnergyAnalysisSurface.GetAnalyticalSpace Method
 Gets the primary analytical space this surface is associated with.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public EnergyAnalysisSpace GetAnalyticalSpace()
Public Function GetAnalyticalSpace As EnergyAnalysisSpace
public:
EnergyAnalysisSpace^ GetAnalyticalSpace()
member GetAnalyticalSpace : unit -> EnergyAnalysisSpace
Return Value
EnergyAnalysisSpace
 The primary analytical space.
See Also
Reference
EnergyAnalysisSurface Class
Autodesk.Revit.DB.Analysis Namespace